EDIT_NAME = {"EN" : "👤 Edit Name",
             "RU" : "👤 Изменить Имя",
             "TJ" : "👤 Исмро Таҳрир Кунед"}
EDIT_NAME_TEXT = {"EN" : "Please enter new name.",
                  "RU" : "Пожалуйста, введите новое имя.",
                  "TJ" : "Лутфан ном-и навро ворид кунед."}
EDIT_NAME_REPLY = {"EN" : "We successfully changed your name!",
                   "RU" : "Мы успешно изменили ваше имя!",
                   "TJ" : "Мо номи шуморо бомуваффақият иваз кардем!"}

EDIT_EMAIL = {"EN" : "📧 Edit E-mail",
              "RU" : "📧 Редактировать Электронную Почту",
              "TJ" : "📧 Почтаи Электрониро Таҳрир Кунед"}
EDIT_EMAIL_TEXT = {"EN" : "Please enter your new email",
                   "RU" : "Пожалуйста, введите ваш новый адрес электронной почты",
                   "TJ" : "Лутфан почтаи электронии-и нави худро ворид кунед"}
EDIT_EMAIL_REPLY = {"EN" : "We successfully changed your email!",
                    "RU" : "Мы успешно изменили ваш адрес электронной почты!",
                    "TJ" : "Мо бомуваффақият почтаи электронии шуморо иваз кардем!"}

EDIT_LANGUAGE = {"EN" : "🌐	Change Language",
                 "RU" : "🌐	Изменить Язык",
                 "TJ" : "🌐	Забонро Иваз Кунед"}

EDIT_LANGUAGE_REPLY = {"EN" : "Your language has been updated!",
                       "RU" : "Ваш язык обновлен!",
                       "TJ" : "Забони шумо нав карда шуд!"}

EDIT_BACK_SIGN = {"EN" : "⬅ Back",
                  "RU" : "⬅ Назад",
                  "TJ" : "⬅ Бозгашт"}