GREET_TESTDRIVE = {
    "EN" : f"Thanks for selecting TajMotors! We will use name and phone number from registration form you filled!Plase fill the from for test drive.🚗\n" 
           f"Please select vehicle you want to <b>drive test</b>:",
    "RU" : f"Спасибо, что выбрали TajMotors! Мы будем использовать имя и номер телефона из регистрационной формы, которую вы заполнили! Пожалуйста, заполните форму для тест-драйва.🚗\n"
              f"Пожалуйста, выберите автомобиль, на котором вы хотите пройти <b>тест-драйв</b>:",
    "TJ" : f"Ташаккур барои интихоби TajMotors! Мо ном ва рақами телефонро аз шакли сабти номе, ки шумо пур кардед, истифода мебарем! Лутфан шакли озмоиши ронданро пур кунед.🚗\n"
              f"Лутфан мошине, ки мехоҳед <b>озмоиши рондан</b> кунед, интихоб кунед:",
}

CHOICE_REPLY = {
    "EN" : "Great choice! We saved your choice:",
    "RU" : "Отличный выбор! Мы сохранили ваш выбор:",
    "TJ" : "Интихоби олӣ! Мо интихоби шуморо сабт кардем:",
}

DATE_SELECTION_TD = {
    "EN" : "Please select date for test drive:",
    "RU" : "Пожалуйста, выберите дату для тест-драйва:",
    "TJ" : "Лутфан санаи озмоиши ронданро интихоб кунед:",
}

TIME_SELECTION_TD = {
    "EN" : " - date selected for test drive. Now, please enter a convenient time (e.g., 10:00).",
    "RU" : " - дата выбрана для тест-драйва. Теперь, пожалуйста, введите удобное время (например, 10:00).",
    "TJ" : " - сана барои озмоиши рондан интихоб карда шуд. Ҳоло, лутфан вақти мувофиқро ворид кунед (масалан, 10:00).",
}

TIME_TD = {
    "EN" : "Please select time for test drive:",
    "RU" : "Пожалуйста, выберите время для тест-драйва:",
    "TJ" : "Лутфан вақти озмоиши ронданро интихоб кунед:",
}

WRONG_DATE_FORMAT_TD = {
    "EN" : "You cannot select a date in the past. Please choose again.",
    "RU" : "Вы не можете выбрать дату в прошлом. Пожалуйста, выберите снова.",
    "TJ" : "Шумо наметавонед санаи гузаштаро интихоб кунед. Лутфан боз интихоб кунед.",
}

SELECTED_DATE_TD = {
    "EN" : "You have selected date and time for test drive: ",
    "RU" : "Вы выбрали дату и время для тест-драйва: ",
    "TJ" : "Шумо сана ва вақти озмоиши ронданро интихоб кардед: ",
}

COMMENTS_TD = {
    "EN" : f"Great. If you have any <b>additional comments</b> or requests, please enter them. Please add contact number in case if we would not be able to reach you with number you registered with.\n\nIf you have no comments, just send a dash (-) to finish filling request form.",
    "RU" : f"Отлично. Если у вас есть какие-либо <b>дополнительные комментарии</b> или запросы, пожалуйста, введите их. Пожалуйста, добавьте контактный номер на случай, если мы не сможем связаться с вами по номеру, с которым вы зарегистрировались.\n\nЕсли у вас нет комментариев, просто отправьте дефис (-), чтобы завершить заполнение формы запроса.",
    "TJ" : f"Аъло. Агар шумо ягон <b>таҳлилҳои иловагӣ</b> ё дархостҳо дошта бошед, лутфан онҳоро ворид кунед. Лутфан рақами тамосро илова кунед, дар сурате ки мо наметавонем бо рақами сабти номшудаи шумо тамос гирем.\n\nАгар шумо ягон шарҳ надошта бошед, танҳо тире (-) фиристонед, то пур кардани шакли дархостро ба итмом расонед.",
}

APPROVED_TESTDRIVE = {
    "EN" : f"Thank you! Your appointment request is complete and has been registered.\n"
        f"We recevied your request for <b>Test Drive</b>.\n<b>Our manager will contact you soon!</b>",
    "RU" : f"Спасибо! Ваша заявка на запись завершена и зарегистрирована.\n"
        f"Мы получили вашу заявку на <b>тест-драйв</b>.\n<b>Наш менеджер свяжется с вами в ближайшее время!</b>",
    "TJ" : f"Ташаккур! Дархости таъйини шумо пурра ва сабт карда шуд.\n"
        f"Мо дархости шуморо барои <b>озмоиши рондан</b> гирифтем.\n<b>Менеҷери мо ба зудӣ бо шумо тамос хоҳад гирифт!</b>",
}